---
kind: property
id: P:Autodesk.Revit.DB.CurveArrArray.Item(System.Int32)
source: html/a2237743-f8fc-b395-78e3-e7af98af4b33.htm
---
# Autodesk.Revit.DB.CurveArrArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual CurveArray this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.